DiplomD/src/Enums/ВидыОценокЗачет/ВидыОценокЗачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОценокЗачет</name>
  <enumValues>
    <name>Зачтено</name>
  </enumValues>
  <enumValues>
    <name>НеЗачтено</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/CommonModules/ПереводВЧетырехБалСистему/Module.bsl
Процедура Перевод(СтрокаТаблЧасти,Оценка,ОбъекмДисц) Экспорт   
						
					Если СтрокаТаблЧасти < ОбъекмДисц.Незачтено Тогда 
						Оценка = перечисления.ВидыОценокЗачет.НеЗачтено; 
					КонецЕсли; 
					Если  СтрокаТаблЧасти >= ОбъекмДисц.Зачтено Тогда 
						Оценка = перечисления.ВидыОценокЗачет.Зачтено; 
					КонецЕсли;
					Если  СтрокаТаблЧасти  >= ОбъекмДисц.Четыре Тогда 
						Оценка = 4; 
					КонецЕсли;
					Если  СтрокаТаблЧасти  >= ОбъекмДисц.Пять Тогда 
						Оценка = 5; 
					КонецЕсли; 
	
КонецПроцедуры
